In [1]:
import pandas as pd
import numpy as np
import matplotlib
from matplotlib import pyplot as plt
from sklearn.metrics import roc_auc_score

import warnings
warnings.filterwarnings('ignore')

Цель - предсказать число выжевших на датасете "Титаник". 
Задача на бинарную классификацию 

Этапы:
1. Обработка признаков, если нужно:

    - обработка пропущенных значений
    - обработка категориальных признаков
    - балансировка классов
    - масштабирование

2. Обучение модели с помощью  LogisticRegression / Randomtree. сравнение

In [2]:
final_test=pd.read_csv('C:/Users/unikum/Downloads/gender_submission.csv')

In [3]:
train=pd.read_csv('C:/Users/unikum/Downloads/train.csv')

In [4]:
test=pd.read_csv('C:/Users/unikum/Downloads/test.csv')

In [5]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
train.shape

(891, 12)

проверим на пропуски

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

что видим.  Age,Cabin,Embarked  are not ful.  5 категориальных признака - нужно обработать

In [9]:
train.dropna().shape # 183 строки с пустыми значениями(NaN). много. удалять нельзя

(183, 12)

In [10]:
test.info() # на тестовой что видим. Age,Cabin, Fare are not ful. 3 категориальных признака - нужно обработать

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [11]:
train.describe(include='object')

                                  Name   Sex  Ticket Cabin Embarked
count                              891   891     891   204      889
unique                             891     2     681   147        3
top     Meanwell, Miss. (Marion Ogden)  male  347082    G6        S
freq                                 1   577       7     4      644

начнем с имени. посмотрим , мож что найдем

In [12]:
train['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

есть миссисы , миссы, серы и так далее) вытащим

In [13]:
train['Title'] = train['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)
test['Title'] = test['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)
# вытаскивает совпадение по образцу в регульяном выражение(все буквы) / уникальные.

In [14]:
pd.crosstab(train['Title'], train['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

что видим. одна Графиня. вот зуб даю , что выжила) посмотрим)

In [15]:
train[train['Name'].str.contains('Countess')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,Countess

вуаля)

дропаем имена. все забрали что можно было

In [16]:
train=train.drop(['Name'],axis=1)
test=test.drop(['Name'],axis=1)

In [17]:
train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,Mr

In [18]:
train['Title'].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Mme           1
Countess      1
Capt          1
Lady          1
Don           1
Jonkheer      1
Sir           1
Ms            1
Name: Title, dtype: int64

отправил часть часть в редкие, другие переименуем  в понятные значения

In [19]:
for dataset in [train, test]:
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
    'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')

In [20]:
train['Title'].value_counts()

Mr        517
Miss      185
Mrs       126
Master     40
Rare       23
Name: Title, dtype: int64

Проверим выживаемость каждой группы

способ 1

In [44]:
train[['Title', 'Survived']].groupby(['Title'], as_index=False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

способ 2

In [33]:
train.groupby(['Title'])[ 'Survived'].agg([np.mean, np.std, np.min, np.max])

            mean       std  amin  amax
Title
Master  0.575000  0.500641     0     1
Miss    0.702703  0.458309     0     1
Mr      0.156673  0.363844     0     1
Mrs     0.793651  0.406300     0     1
Rare    0.347826  0.486985     0     1

способ 3

In [54]:
train.groupby(['Title'])[ 'Survived'].describe()

        count      mean       std  min  25%  50%  75%  max
Title
Master   40.0  0.575000  0.500641  0.0  0.0  1.0  1.0  1.0
Miss    185.0  0.702703  0.458309  0.0  0.0  1.0  1.0  1.0
Mr      517.0  0.156673  0.363844  0.0  0.0  0.0  0.0  1.0
Mrs     126.0  0.793651  0.406300  0.0  1.0  1.0  1.0  1.0
Rare     23.0  0.347826  0.486985  0.0  0.0  0.0  1.0  1.0

**лучше быть замужжней женщиной :))**

обработаепм признак Title к.к.домен признака имеет всего 5 допустимых значения восользуемся onehot encoding

pd.get_dummies делает это

In [55]:
train=pd.concat((train,pd.get_dummies(train['Title'])), axis=1).drop(['Title'],axis=1) 
test=pd.concat((test,pd.get_dummies(test['Title'])), axis=1).drop(['Title'],axis=1)

заменим бинарные катег. пизнаки на 1 и 0

In [56]:
d={'male':1, 'female':0}

In [57]:
train['Sex'] = train['Sex'].map(d)

In [58]:
test['Sex'] = test['Sex'].map(d)

In [59]:
train=train.drop(['PassengerId'], axis=1)

обработаепм признак embarked/ т.к. домен признака  имеет всего 3 допустимых значения восользуемся onehot encoding

pd.get_dummies делает это

In [60]:
pd.get_dummies(train['Embarked']).head()

   C  Q  S
0  0  0  1
1  1  0  0
2  0  0  1
3  0  0  1
4  0  0  1

In [61]:
train=pd.concat((train,pd.get_dummies(train['Embarked'])), axis=1).drop(['Embarked'],axis=1)

In [62]:
test=pd.concat((test,pd.get_dummies(test['Embarked'])), axis=1).drop(['Embarked'],axis=1)

In [63]:
train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Master,Miss,Mr,Mrs,Rare,C,Q,S
0,0,3,1,22.0,1,0,A/5 21171,7.2500,NaN,0,0,1,0,0,0,0,1
1,1,1,0,38.0,1,0,PC 17599,71.2833,C85,0,0,0,1,0,1,0,0
2,1,3,0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,1,0,0,0,0,0,1
3,1,1,0,35.0,1,0,113803,53.1000,C123,0,0,0,1,0,0,0,1
4,0,3,1,35.0,0,0,373450,8.0500,NaN,0,0,1,0,0,0,0,1

какие мысли. какой тикет и кабина коррелируется с ценой билета и возрастом/полом пассажира - тоесть отражены в цене билета/возрасте и поле пассажира. попробую удалить вообще. если кач-во будет низким вернусь к обработке (наверно lablom encoding)

In [25]:
train_count=train_sex_emb.drop(['Ticket','Cabin','PassengerId'],axis=1)

In [26]:
test_count=test_sex_emp.drop(['Ticket','Cabin','PassengerId'],axis=1)

In [27]:
test_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
Pclass    418 non-null int64
Sex       418 non-null int64
Age       332 non-null float64
SibSp     418 non-null int64
Parch     418 non-null int64
Fare      417 non-null float64
C         418 non-null uint8
Q         418 non-null uint8
S         418 non-null uint8
dtypes: float64(2), int64(4), uint8(3)
memory usage: 20.9 KB

In [28]:
train_count.corr()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,C,Q,S
Survived,1.000000,-0.338481,-0.543351,-0.077221,-0.035322,0.081629,0.257307,0.168240,0.003650,-0.155660
Pclass,-0.338481,1.000000,0.131900,-0.369226,0.083081,0.018443,-0.549500,-0.243292,0.221009,0.081720
Sex,-0.543351,0.131900,1.000000,0.093254,-0.114631,-0.245489,-0.182333,-0.082853,-0.074115,0.125722
Age,-0.077221,-0.369226,0.093254,1.000000,-0.308247,-0.189119,0.096067,0.036261,-0.022405,-0.032523
SibSp,-0.035322,0.083081,-0.114631,-0.308247,1.000000,0.414838,0.159651,-0.059528,-0.026354,0.070941
Parch,0.081629,0.018443,-0.245489,-0.189119,0.414838,1.000000,0.216225,-0.011069,-0.081228,0.063036
Fare,0.257307,-0.549500,-0.182333,0.096067,0.159651,0.216225,1.000000,0.269335,-0.117216,-0.166603
C,0.168240,-0.243292,-0.082853,0.036261,-0.059528,-0.011069,0.269335,1.000000,-0.148258,-0.778359
Q,0.003650,0.221009,-0.074115,-0.022405,-0.026354,-0.081228,-0.117216,-0.148258,1.000000,-0.496624
S,-0.155660,0.081720,0.125722,-0.032523,0.070941,0.063036,-0.166603,-0.778359,-0.496624,1.000000

видна корреляция с полом/стоимостью билет и классом. видимо спасали богатых) ну он о и понятно. еще , странно, но прослележивается нулевая корелляция у одно из городов, где была загрузка   - у двух других она есть.

корелляция с возрастом небольшая, либо так, либо данных сильно мало.

добавим значения возраста. добавим среднее значение. Хотя лучше, наверно, добавить среднее не от общих данных, а от группы, например если один в каюте, то это точно не ребенок, а значит и средний возраст будет больше. 

Также есть мысли что данные по возрасту не записыввали, потому что чернь., а если чернь, то погибнет первой. если кач-во не устроит - вернемся  и обработаем

In [43]:
train_final=train_count.fillna(train['Age'].mean(axis=0), axis=0)

In [44]:
test_final=test_count.fillna(test['Age'].mean(axis=0), axis=0)

In [45]:
train_target=train_final['Survived']

In [46]:
train_final=train_final.drop(['Survived'],axis=1)

**обучим модели. сплитанем данныве. выберем лучший алго. далее обучем его заново на данных трейн (полностью без сплита) и отправим их на кагл**

In [47]:
from sklearn.linear_model import LogisticRegression
from sklearn import model_selection,metrics
from sklearn.model_selection import train_test_split

In [48]:
X_train,X_test, y_train,y_test= train_test_split(train_final, train_target, 
                                     test_size=0.3, 
                                     random_state=0)

In [49]:
classifier=LogisticRegression(class_weight='balanced') 
# доавил параметр class_weight='balanced', так как классы не сбалансированы

In [51]:
clf=classifier.fit(X_train,y_train)

In [52]:
print('accuracy: {}'.format(metrics.accuracy_score(y_test, clf.predict(X_test))),
     'roc_auc_score: {}'.format(roc_auc_score(y_test, clf.predict(X_test)))   
     )

accuracy: 0.7910447761194029 roc_auc_score: 0.7847619047619048

In [53]:
print(metrics.classification_report(y_test, clf.predict(X_test)))

              precision    recall  f1-score   support

           0       0.85      0.81      0.83       168
           1       0.70      0.76      0.73       100

   micro avg       0.79      0.79      0.79       268
   macro avg       0.78      0.78      0.78       268
weighted avg       0.80      0.79      0.79       268

In [54]:
from sklearn.ensemble import RandomForestClassifier

In [55]:
classifier_Tree=RandomForestClassifier(n_estimators = 50, max_depth=25,random_state = 0)

In [56]:
clf_tree=classifier_Tree.fit(X_train,y_train)

In [57]:
print('accuracy: {}'.format(metrics.accuracy_score(y_test, clf_tree.predict(X_test))),
     'roc_auc_score: {}'.format(roc_auc_score(y_test, clf_tree.predict(X_test)))   
     )

accuracy: 0.8283582089552238 roc_auc_score: 0.8064285714285715

In [58]:
print(metrics.classification_report(y_test, clf_tree.predict(X_test)))

              precision    recall  f1-score   support

           0       0.84      0.89      0.87       168
           1       0.80      0.72      0.76       100

   micro avg       0.83      0.83      0.83       268
   macro avg       0.82      0.81      0.81       268
weighted avg       0.83      0.83      0.83       268




**Балансировка**

In [59]:
y_train.value_counts(normalize=True)

0    0.611557
1    0.388443
Name: Survived, dtype: float64

классы не сбалансирвоаны. добавим в выборку разницу

In [60]:
np.sum(y_train==0) - np.sum(y_train==1)

139

In [61]:
count=np.sum(y_train==0) - np.sum(y_train==1)

In [62]:
indices_to_add = np.random.randint(np.sum(y_train==1), size=count) # рандомные индексы, по которым будем брать даныне из выборки

In [63]:
X_train_numpy=X_train.to_numpy()

In [64]:
X_train_to_add = X_train_numpy[y_train.to_numpy() == 1][indices_to_add] 
#  из выборки берем данные (139 строк) с единицами в таргете

In [65]:
X_train_balanced = np.concatenate(( X_train, X_train_to_add)) 
y_train_balanced = np.concatenate((y_train, np.ones(count)))
# сконкатенируем выборки

In [66]:
classifier_bal=LogisticRegression()

In [67]:
clf_balance=classifier_bal.fit(X_train_balanced,y_train_balanced)

In [68]:
print('accuracy: {}'.format(metrics.accuracy_score(y_test, clf_balance.predict(X_test))),
     'roc_auc_score: {}'.format(roc_auc_score(y_test, clf_balance.predict(X_test)))   
     )

accuracy: 0.7873134328358209 roc_auc_score: 0.7838095238095238

In [69]:
print(metrics.classification_report(y_test, clf_balance.predict(X_test)))

              precision    recall  f1-score   support

           0       0.85      0.80      0.82       168
           1       0.69      0.77      0.73       100

   micro avg       0.79      0.79      0.79       268
   macro avg       0.77      0.78      0.78       268
weighted avg       0.79      0.79      0.79       268

*вывод: логит чувствителен к балансирвке. показатель вырос после балансировки.*

*дерьвья не нуждаются в балансировки*

**Нормализация**

In [70]:
train_final.head() # сильно выбивается данные о возрасте и цене билета нормальзуем данные

   Pclass  Sex   Age  SibSp  Parch     Fare  C  Q  S
0       3    1  22.0      1      0   7.2500  0  0  1
1       1    0  38.0      1      0  71.2833  1  0  0
2       3    0  26.0      0      0   7.9250  0  0  1
3       1    0  35.0      1      0  53.1000  0  0  1
4       3    1  35.0      0      0   8.0500  0  0  1

In [71]:
train_final.describe()

,Pclass,Sex,Age,SibSp,Parch,Fare,C,Q,S
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,2.308642,0.647587,29.699118,0.523008,0.381594,32.204208,0.188552,0.086420,0.722783
std,0.836071,0.477990,13.002015,1.102743,0.806057,49.693429,0.391372,0.281141,0.447876
min,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2.000000,0.000000,22.000000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000
50%,3.000000,1.000000,29.699118,0.000000,0.000000,14.454200,0.000000,0.000000,1.000000
75%,3.000000,1.000000,35.000000,1.000000,0.000000,31.000000,0.000000,0.000000,1.000000
max,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000

In [72]:
from sklearn.preprocessing import StandardScaler

In [73]:
scaler = StandardScaler()
scaler.fit(X_train) # обучаем на выборке для обучения чтобы не залезть в будущее
# (нельзя обучать на данных из теста - будушего, данных у нас этих нет и алгоритм переобучится)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [74]:
X_train_real_scaled=scaler.transform(X_train) # трансформируем после обучения 
X_test_real_scaled=scaler.transform(X_test) # трансформируем после обучения 
# можно заменить одним методом  для мастштаб обучающей выборки scaler.fit_transform(X_train_real_zeros )

In [75]:
classifier_csal=LogisticRegression(class_weight='balanced')

In [76]:
clf_scal=classifier.fit(X_train_real_scaled,y_train)

In [77]:
metrics.accuracy_score(y_test, clf_scal.predict(X_test_real_scaled))

0.7947761194029851

In [78]:
print(metrics.classification_report(y_test,clf_scal.predict(X_test_real_scaled)))

              precision    recall  f1-score   support

           0       0.86      0.81      0.83       168
           1       0.71      0.77      0.74       100

   micro avg       0.79      0.79      0.79       268
   macro avg       0.78      0.79      0.78       268
weighted avg       0.80      0.79      0.80       268

*выводы. странно но показатель не сильно изменился. хотя логит имеет l2 регуляризтор и должен сильно штрафоовать признаки такие как возраст и цену...*

стратифицируем выборки. сбалансируем и нормализуем

**Стратификация**

In [79]:
X_train_str,X_test_str, y_train_str,y_test_str= train_test_split(train_final, train_target, 
                                     test_size=0.3,
                                     random_state=0)

In [80]:
y_test_str.value_counts(normalize=True)

0    0.626866
1    0.373134
Name: Survived, dtype: float64

In [81]:
scaler_new = StandardScaler()
scaler_new.fit(X_train_str)
X_train_real_scaled_strat=scaler_new.transform(X_train_str) # трансформируем после обучения 
X_test_real_scaled_strat=scaler_new.transform(X_test_str)

In [82]:
classifier_strat=LogisticRegression(class_weight = 'balanced')
clf_stat=classifier_strat.fit(X_train_real_scaled_strat, y_train_str )

In [83]:
metrics.accuracy_score(y_test_str,clf_stat.predict(X_test_real_scaled_strat))

0.7947761194029851

In [84]:
roc_auc_score(y_test,classifier.predict(X_test_real_scaled_strat))

0.7897619047619048

In [85]:
print(metrics.classification_report(y_test,classifier.predict(X_test_real_scaled_strat)))

              precision    recall  f1-score   support

           0       0.86      0.81      0.83       168
           1       0.71      0.77      0.74       100

   micro avg       0.79      0.79      0.79       268
   macro avg       0.78      0.79      0.78       268
weighted avg       0.80      0.79      0.80       268

*результат тот же. скорее всего, из-за того что в бинарной классификации сплит делит по дефолту выборук стратифицировано*

**попробуем трансформировать признаки**

In [86]:
from sklearn.preprocessing import PolynomialFeatures

In [87]:
transform = PolynomialFeatures(2)
data_train_poly = transform.fit_transform(X_train)
data_test_poly = transform.transform(X_test)

In [88]:
scaler_pol = StandardScaler()
X_train_pol= scaler_pol.fit_transform(data_train_poly)  # трансформируем после обучения 
X_test_pol=scaler_pol.transform(data_test_poly)

In [89]:
X_train_pol[0] #спрямляющие пространства. добавили квадратичные признаки и нормализовали

array([ 0.        , -1.5325562 ,  0.72592065,  1.62393675, -0.457246  ,
       -0.47299765, -0.12253019, -0.45793967, -0.31426968,  0.60269272,
       -1.42869504, -0.42545665, -0.41939499, -0.38686037, -0.41983239,
       -0.50111762, -0.40139774, -0.3119116 , -0.56625075,  0.72592065,
        1.72839431, -0.30666838, -0.30737779,  0.21562157, -0.3294555 ,
       -0.2249227 ,  0.98249666,  1.73041801, -0.42017644, -0.34646769,
        0.17824209, -0.41116078, -0.29693115,  1.68849067, -0.22431958,
       -0.28410763, -0.31887699, -0.23422097, -0.11688537, -0.38643304,
       -0.29031622, -0.29934302, -0.19755004, -0.08273305, -0.40539315,
       -0.15978557, -0.24931744, -0.22020358,  0.15698976, -0.45793967,
        0.        ,  0.        , -0.31426968,  0.        ,  0.60269272])

In [90]:
classifier_poly=LogisticRegression(class_weight = 'balanced')

In [91]:
clf_poly=classifier_poly.fit(data_train_poly,y_train)

In [92]:
metrics.accuracy_score(y_test,clf_poly.predict(data_test_poly))

0.7947761194029851

In [93]:
roc_auc_score(y_test,clf_poly.predict(data_test_poly))

0.7836904761904762

In [94]:
print(metrics.classification_report(y_test,clf_poly.predict(data_test_poly)))

              precision    recall  f1-score   support

           0       0.84      0.83      0.83       168
           1       0.72      0.74      0.73       100

   micro avg       0.79      0.79      0.79       268
   macro avg       0.78      0.78      0.78       268
weighted avg       0.80      0.79      0.80       268

*логит выдает максимум 0.794 по точночти. никакие манипуляции с алго не помагают. дереьвтя показывают лучшую точность.
попробую поискать зависимость в признаках далее*

**лушчий алго - случайный лес. обучим теперь его на полных данных и отправим предикшн на кагл**

In [421]:
clf_forest=classifier_Tree.fit(train_final,train_target)

In [422]:
pred=clf_forest.predict(test_final)

In [423]:
final = pd.DataFrame(final_test.iloc[:,0])

In [424]:
final['Survived']=pd.DataFrame(pred)